In [2]:
import numpy as np
import pandas as pd 
import sklearn
import seaborn as sns 
import matplotlib.pyplot as plt

In [3]:
data = pd.read_csv("C:/Users/yashaswini/Downloads/DATA2 (1).csv")

In [4]:
df = pd.DataFrame(data)

In [5]:
df

       Name   Age  Marks Performance
0     Rohan  18.0   60.0          No
1  Spoorthi  22.0   70.0         Yes
2       Ram  21.0   67.0          No
3    Sachin  20.0   76.0          No
4     Madhu  26.0    NaN         Yes
5       Sam  23.0   58.0         Yes
6       Anu   NaN   80.0          No
7  Bharathi  24.0   90.0         Yes
8     Sammu  25.0    NaN          No
9      Asha  28.0   82.0         Yes

In [6]:
df.isnull().sum()

Name           0
Age            1
Marks          2
Performance    0
dtype: int64

In [8]:
df[df.isnull().any(axis=1)]

    Name   Age  Marks Performance
4  Madhu  26.0    NaN         Yes
6    Anu   NaN   80.0          No
8  Sammu  25.0    NaN          No

In [9]:
df = df.copy()

In [10]:
mean_salary = df['Age'].mean()
df['Age'] = df['Age'].fillna(mean_salary)
avg_age = df['Marks'].mean()
df['Marks'].fillna(avg_age)
df

       Name   Age  Marks Performance
0     Rohan  18.0   60.0          No
1  Spoorthi  22.0   70.0         Yes
2       Ram  21.0   67.0          No
3    Sachin  20.0   76.0          No
4     Madhu  26.0    NaN         Yes
5       Sam  23.0   58.0         Yes
6       Anu  23.0   80.0          No
7  Bharathi  24.0   90.0         Yes
8     Sammu  25.0    NaN          No
9      Asha  28.0   82.0         Yes

In [11]:
df.isnull().sum()

Name           0
Age            0
Marks          2
Performance    0
dtype: int64

In [13]:
df[df.isnull().any(axis=1)]

    Name   Age  Marks Performance
4  Madhu  26.0    NaN         Yes
8  Sammu  25.0    NaN          No

In [14]:
df.isnull().sum()

Name           0
Age            0
Marks          2
Performance    0
dtype: int64

In [15]:
df = df.copy()

In [ ]:
print("before:",df.shape)
d